function showSection(section) {
    const content = document.getElementById('info');

    const sections = {
        topic: `
            <h2>Тема Мета Місце розташування лаб №8</h2>
            <p><b>Тема:</b>WEB-СХОВИЩЕ. WEB STORAGE API. МОДУЛЬНОСТЬ  КОДУ. СТВОРЕННЯ МОДАЛЬНОГО ВІКНА. ДЕЛЕГУВАННЯ ПОДІЙ. </p>
            <p><b>Мета:</b>придбати практичні навички роботи створення модального вікна; повторити процес створення макету, зокрема створення макету галереї довільних зображень; закріпити навички роботи з делегуванням подій.</p>
            <br>
            <p>Посилання на живу сторінку: https://nababenko.github.io/web_lab8/
            <a href="https://nababenko.github.io/web_lab8/">https://nababenko.github.io/web_lab8/</a></p>
            <p>Посилання на GitHub: https://github.com/nababenko/web_lab8
            <a href="https://github.com/nababenko/web_lab8">https://github.com/nababenko/web_lab8</a></p><br>

        `,
        task1: `
            <h2>Завдання №1</h2>
            <img src="../resources/t1%20(1).png"><br>
            <img src="../resources/t1%20(4).png"><br>
            <img src="../resources/t1%20(3).png"><br>
            <img src="../resources/t1%20(2).png">
            
           `,
        task2: `
           <h2>Завдання №2</h2>           
            <img src="../resources/t2%20(5).png"><br>
            <img src="../resources/t2%20(1).png"><br>
            <img src="../resources/t2%20(4).png"><br>
            <img src="../resources/t2%20(2).png"><br>
            <img src="../resources/t2%20(3).png">
           
        `,
        conclusion: `
            <h2>ВИСНОВКИ</h2>
            <p>У ході виконання лабораторної роботи на тему "WEB-СХОВИЩЕ. WEB STORAGE API. МОДУЛЬНОСТЬ КОДУ. СТВОРЕННЯ МОДАЛЬНОГО ВІКНА. ДЕЛЕГУВАННЯ ПОДІЙ" було здобуто практичні навички створення модального вікна, що забезпечує інтерактивність веб-додатків, а також закріплено вміння працювати з делегуванням подій, яке оптимізує взаємодію з елементами інтерфейсу. В процесі роботи реалізовано макет галереї довільних зображень із функцією інтерактивної взаємодії, що дозволило повторити основні аспекти створення макетів. Окрім того, освоєно роботу з WEB STORAGE API для збереження даних у локальному та сесійному сховищах браузера, що забезпечує функціональність збереження стану додатка. Код було структуровано за принципами модульності, що сприяє його гнучкості, повторному використанню та легкості розширення функціоналу.</p>
            
        `
    };

    content.innerHTML = sections[section] || 'Інформація не знайдена.';
}