function showSection(section) {
    const content = document.getElementById('info');

    const sections = {
        topic: `
            <h2>Тема Мета Місце розташування лаб №4</h2>
            <p>Тема: АДАПТИВНА ВЕРСТКА. МЕДІА-ЗАПИТИ. МЕТАТЕГ VIEWPORT. СТРАТЕГІЯ MOBILE FIRST. </p>
            <p>Мета: Адаптивна верстка. Медіа-запити. Медіа-типи. Медіа-функції.Метатег viewport. Інструменти розробника. Стратегія Mobile First. </p>
            <br>
            <p>Посилання на живу сторінку: https://nababenko.github.io/web_lab4/
            <a href="https://nababenko.github.io/web_lab4/">https://nababenko.github.io/web_lab4/</a></p>
            <p>Посилання на GitHub: https://github.com/nababenko/web_lab4
            <a href="https://github.com/nababenko/web_lab4">https://github.com/nababenko/web_lab4</a></p><br>

        `,
        desktop: `
            <img src="../resources/desk.png" alt="item" width="600">
            <img src="../resources/desk1.png" alt="item" width="980">

           `,
        tablet: `
           <img src="../resources/tablet.png" alt="item" width="600">
            <img src="../resources/tablet1.png" alt="item">

        `,
        mobile: `
            <img src="../resources/mobile.png" alt="item" width="600">
            <img src="../resources/mobile1.png" alt="item">
            
        `,
        operators: `
            <p>Адаптивна верстка з використанням CSS дозволяє сайту коректно відображатися на різних пристроях з різними розмірами екрану. Логічні оператори в CSS часто використовуються у медіа-запитах (media queries), які дозволяють застосовувати різні стилі в залежності від умов (розміру екрану, орієнтації тощо).<br>
            Логічні оператори в CSS, такі як <b>and</b>, <b>or</b> (записаний як ,), і <b>not</b>, використовуються в медіа-запитах для комбінування умов, які визначають, коли певні стилі мають бути застосовані. Оператор <b>only</b> — для таргетингу специфічних пристроїв. </p>
            <img src="../resources/lo.png" alt="item">
            <p>У даному випадку оператор <b>and</b> гарантує, що стилі будуть застосовані лише тоді, коли ширина екрану перебуває між 768 пікселями (включно) і 1024 пікселями (включно).<br>
            Оператор <b>only</b> застосовується для обмеження медіа-запиту лише до екранів. Це допомагає уникнути непередбачених результатів на різних типах виводу.</p>
        `,

        conclusion: `
            <h2>ВИСНОВКИ</h2>
            <p> У ході лабораторної роботи було розглянуто і застосовано основні принципи адаптивної верстки веб-сторінок. Завдяки використанню медіа-запитів, медіа-типів та медіа-функцій, вдалося забезпечити коректне відображення контенту на різних пристроях з різними розмірами екрану. Метатег viewport дозволив налаштувати масштабування сторінки для мобільних пристроїв, що є важливим для зручності користувача. Я дізналась про стратегію Mobile First, що забезпечує пріоритетну розробку для мобільних пристроїв, з подальшою адаптацією для більших екранів.<br>
                <br>Інструменти розробника в браузерах допомогли в процесі тестування та налагодження верстки, дозволяючи перевірити поведінку сторінки в різних умовах. Таким чином, лабораторна робота продемонструвала ефективність застосування адаптивних технік для створення зручних і функціональних веб-сторінок, що відповідають сучасним вимогам.
            </p>
        `
    };

    content.innerHTML = sections[section] || 'Інформація не знайдена.';
}