function showSection(section) {
    const content = document.getElementById('info');

    const sections = {
        topic: `
            <h2>Тема Мета Місце розташування лаб №7</h2>
            <p><b>Тема:</b> КЛАСИ. ОБ'ЄКТНА МОДЕЛЬ ДОКУМЕНТА (DOM). ПОДІЇ. ОБ'ЄКТ ПОДІЇ. ДЕЛЕГУВАННЯ ПОДІЙ.</p>
            <p><b>Мета:</b>придбати практичні навички роботи з об'єктами. Методи об'єкта. Callback. Стрілочні функції. Стрілочні функції як колбеки. Реалізація програм засовами мови JAVASCRIPT</p>
            <br>
            <p>Посилання на живу сторінку: https://nababenko.github.io/web_lab7/
            <a href="https://nababenko.github.io/web_lab6/">https://nababenko.github.io/web_lab7/</a></p>
            <p>Посилання на GitHub: https://github.com/nababenko/web_lab7
            <a href="https://github.com/nababenko/web_lab6">https://github.com/nababenko/web_lab7</a></p><br>

        `,
        task1: `
            <h2>Завдання №1</h2>
            
            
           `,
        task3: `
           <h2>Завдання №3</h2>
           
           
        `,
        task5: `
           <h2>Завдання №5</h2>
            
        `,
        task7: `
           <h2>Завдання №7</h2>            
            
        `,
        task8: `
           <h2>Завдання №8</h2>            
            
        `,
        task9: `
           <h2>Завдання №9</h2> 
           
        `,
        task10: `
           <h2>Завдання №10</h2> 
           
           
        `,

        conclusion: `
            <h2>ВИСНОВКИ</h2>
            <p>У ході виконання лабораторної роботи було здобуто практичні навички роботи з об'єктами у JavaScript. Ознайомлено з методами об'єктів та їх застосуванням у програмуванні. Досліджено використання стрілочних функцій як колбеків для забезпечення більш зручного синтаксису. Реалізовано кілька програм, що демонструють переваги стрілочних функцій у контексті роботи з методами об'єктів. Робота дозволила закріпити розуміння ключових аспектів об'єктно-орієнтованого програмування в JavaScript.






</p>
            
        `
    };

    content.innerHTML = sections[section] || 'Інформація не знайдена.';
}